Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/courtroom/jury_service.html.txt.tmx
Source language: en
Languages: ga

source: • Eligibility for jury service
ga: • Incháilitheacht do sheirbhís ghiúiré

source: • Payment on jury service
ga: • Íocaíocht maidir le seirbhís ghiúiré

source: Most non-minor criminal offences require a trial by a judge and jury
ga: Is gá triail faoi bhreitheamh agus giúiré leis an gcuid is mó de chionta coiriúla nach mionchionta iad

source: Some civil cases, for example, defamation, require a jury trial
ga: Teastaíonn triail ghiúiré ó chásanna sibhialta áirithe, an aithis, mar shampla

source: Information on what jurors do is available in our document on the role of a jury
ga: Tá eolas ar cad a dhéanann giúróirí ar fáil inár ndoiciméad ar an ról a bheadh ​​giúiré

source: Jurors are contacted by summons of the County Registrar, which will state that you are obliged to attend for jury service on a particular date
ga: Déantar teagmháil le giúróirí trí thoghairm ón gCláraitheoir Contae, a shonróidh go bhfuil sé d’iallach ort freastal faoi choinne sheirbhís ghiúiré ar dháta faoi leith

source: Eligibility for jury service
ga: Incháilitheacht do sheirbhís ghiúiré

source: Every Irish citizen from the age of 18 (no upper age limit since 1 January 2009) who is on the Register of Dáil Electors is eligible for jury service except:
ga: Bíonn gach saoránach na hÉireann ó 18 bliain d’aois atá ar Chlár na dToghthóirí Dála incháilithe do sheirbhís ghiúiré cé is moite de:

source: • Those involved in any way with the administration of justice
ga: • Iad siúd a mbíonn baint acu in aon slí le riaradh an cheartais

source: This includes judges, former judges, the President, the Attorney General, the Director of Public Prosecutions, members of the Gardai and defence forces, prison officers, practising barristers, solicitors, court officers such as registrars and personnel in Government departments involved in matters of justice or the courts
ga: Áirítear leo seo breithiúna, iar-bhreithiúna, an tUachtarán, an tArd-Aighne, An Stiúrthóir Ionchúiseamh Poiblí, baill den Gharda agus Óglaigh na hÉireann, oifigigh phríosúin, abhcóidí cleachtais, aturnaetha, oifigigh na cúirte ar nós cláraitheoirí agus pearsanra sna Ranna Rialtais a mbíonn baint acu le cúrsaí ceartais nó leis na cúirteanna

source: • Those who are unable to read or have a long-term impairment so that it is not practicable for them to serve on a jury
ga: • Iad siúd nach bhfuil in ann a léamh nó a bhfuil mallachar fadtéarmach ionas nach bhfuil sé indéanta dóibh chun fónamh ar ghiúiré

source: The rules about eligibility for jury service in Ireland are set down in Section 6 and the First Schedule of the Juries Act, 1976 as amended by Section 54 and Section 64 of the Civil Law (Miscellaneous Provisions) Act 2008
ga: Leagtar síos na rialacha i gcomhair incháilitheachta do sheirbhís ghiúiré i Alt 6 agus an Chéad Sceideal de Acht na nGiúiréithe, 1976 arna leasú ag Alt 54 agus Alt 64 den Acht um an Dlí Sibhialta (Forálacha Ilghnéitheacha) 2008

source: The following persons are disqualified from jury service:
ga: Bíonn na daoine seo a leanas dícháilithe ó sheirbhís ghiúiré:

source: • Those who have been convicted of a serious offence in Ireland
ga: • Iad siúd a ciontaíodh i gcion tromchúiseach in Éirinn

source: • Those who have ever been sentenced to a term of imprisonment of five years or more
ga: • Iad siúd ar gearradh téarma príosúnachta de chúig bliana nó ní ba mhó orthu riamh

source: • Those who, within the last ten years, have been sentenced to a term of imprisonment of three months
ga: • Iad siúd ar gearradh téarma príosúnachta de thrí mhí orthu raimh le deich mbliana anuas

source: • People living in Ireland who are not Irish citizens
ga: • Daoine a chónaíonn in Éirinn nach saoránaigh na hÉireann iad

source: Those who are excused as of right
ga: Iad siúd a scaoiltear ón giúiré de bharr a gceart

source: The following persons may be excused as of right from jury service:
ga: Féadfar scaoileadh leis na daoine seo a leanas ó sheirbhís ghiúiré de bharr a gceart:

source: • Since January 2009 those aged 65 or over
ga: • Ó Eanáir 2009, siúd atá 65 bliain d'aois nó os a chionn

source: • Members of the either House of the Oireachtas (the Irish Parliament), members of the Council of State, the Comptroller and Auditor General, the Clerks of Dáil Éireann and Seanad Éireann, a person in Holy Orders, a minister of any religious denomination or community, members of monasteries and convents, aircraft pilots, full-time students and ship's masters
ga: • Baill de Thithe an Oireachtais (ceachtar teach), baill den Chomhairle Stáit, an tArd-Reachtaire Cuntas agus Ciste, Cléirigh Dháil Éireann agus Seanad Éireann, duine in Ord Beannaithe, ministéir d’aon sainchreideamh nó pobal creidimh, baill de mhainistreacha nó clochair, piolótaí aerárthaigh, mic léinn lán-aimseartha agus máistirí loinge

source: • Those who provide an important community service, such as practising doctors, nurses, midwives, dentists, vets, chemists, etc
ga: • Iad siúd a sholáthraíonn seirbhís thábhachtach don phobal, ar nós dochtúirí, altraí, cnáimhseacha (mná cabhrach), fiaclóirí, tréidlianna, poitigéirí srl

source: • The following persons if it is certified that their functions cannot reasonably be performed by another person or postponed; members of staff of either House of the Oireachtas, Heads of Government Departments, other civil servants, chief executive officers and employees of local authorities, Health Service Executive (HSE) Areas and harbour authorities, school teachers and university lecturers
ga: • Na daoine seo a leanas má dheimhnítear nach féidir le duine eile a bhfeidhmeanna a dhéanamh go réasúnta nó nach fhéidir iad a chur siar; baill fhoirne de cheachtar Teach an Oireachtais, Cinn de Ranna Rialtais, státseirbhísigh eile, príomhoifigigh fheidhmiúcháin agus fostaithe na n-údarás áitiúil, na mbord sláinte agus údaráis na gcuanta, múinteoirí scoile agus léachtóirí ollscoile

source: • Those who have served on a jury within the last three years or who have been excused by a judge at the conclusion of a previous period of service for a period that has not ended
ga: • Iad siúd a bhí ar ghiúiré cheana le trí bliana anuas nó ar scaoil breitheamh leo ag deireadh thréimhse seirbhíse roimhe seo do thréimhse seirbhíse nach bhfuil críochnaithe

source: Other occasions when you may be excused
ga: Ócáidí eile ar ar féidir scaoileadh leat

source: Other occasions when you may be excused include:
ga: Áirítear leis na hócáidí eile ar ar féidir scaoileadh leat:

source: • The County Registrar or the trial judge may excuse you if he is satisfied that there is "good reason" for doing so
ga: • Féadann an Cláraitheoir Contae nó breitheamh na trialach scaoileadh leat má cheapann siad go bhfuil "cúis mhaith" ann leis

source: • At the end of a case of "an exceptionally exacting nature", the trial judge may excuse the jury from jury service for as long as the judge considers fit
ga: • Ag deireadh cáis "de mianach dian eisceachtúil", féadann breitheamh na trialach scaoileadh leis an ngiúiré ó sheirbhís ghiúiré ar feadh chomh fada agus is oiriúnach leo é

source: The rules about ineligibility and disqualification from jury service are set out in Section 7 and Section 8 of the Juries Act, 1976
ga: Leagtar amach na rialacha faoi neamh-incháilitheacht agus dícháiliú ó sheirbhís ghiúiré in Alt 7 d’Acht na nGiúiréithe, 1976 agus in Alt 8 d’Acht na nGiúiréithe, 1976

source: Under the Juries Act, the following offences are punishable by fines:
ga: Déantar teagmháil le giúróirí trí thoghairm ón gCláraitheoir Contae

source: • Failing to attend for jury service without reasonable excuse, or not being available when called upon to serve as a juror or being unfit for service by reason of drink or drugs
ga: Ní mór duit freagairt don toghairm ghiúiré trí úsáid a bhaint as an fhoirm agus an clúdach litreach réamh-íoctha a sholáthraítear

source: • Making or causing to be made on behalf of a person summoned as a juror any false representations to enable him or her to evade jury service. Selection of jurors
ga: Má thiteann tú laistigh de na catagóirí daoine a mbíonn sé de cheart acu a bheith saor ó sheirbhís ghiúiré, caithfidh tú é sin a mhaíomh ar an fhoirm a sholáthraítear

source: If you wish to be excused for another reason (such as illness), you must state that reason and the County Registrar will make a decision as to whether or not you may be excused
ga: Más mian leat go scaoilfear leat ó do dhualgais ar chúis eile (ar nós tinnis), caithfidh tú an chúis sin a shonrú agus déanfaidh an Cláraitheoir Contae cinneadh an féidir tú a scaoileadh saor

source: All the jury members summonsed that are not excused must attend in court on the first day the panel is formed
ga: Gach giúróir a dtugtar toghairm dóibh, ní mór dóibh freastal ar an gcúirt ar an gcéad lá a chuirtear painéal an ghiúiré le chéile

source: The name of every juror is called out and you must answer to show you are in attendance
ga: Glaoitear ainm gach giúróir agus caithfidh tú freagairt chun a léiriú go bhfuil tú i láthair

source: In order to select a panel of 12 jurors for a particular case, names are drawn out of a ballot box
ga: Tarraingítear ainmneacha ó bhosca ballóide chun is go gcuirfí painéal 12 giúróir le chéile

source: If your name is called, you will go to the jury box and you will be given an opportunity to state if you are ineligible for or disqualified from jury service or if you know any of the witnesses in the case
ga: Má ghlaoitear d’ainm rachaidh tú i mbosca na ngiúróirí agus tabharfar deis duit le maíomh más neamh-incháilithe nó dícháilithe ó sheirbhís giúiré tú nó más aithnid duit aon duine de na finnéithe sa chás

source: Section 23 of the Courts and Civil Law (Miscellaneous Provisions) Act 2013 amended the Juries Act 1976 so that the jury can consist of up to 15 members, if the case is expected to last more than 2 months
ga: Leasaigh Alt 23 den Acht gCúirteanna agus Dlí Sibhialta (Forálacha Ilghnéitheacha) 2013 an tAcht na nGiúiréithe 1976 ionas gur féidir leis an giúiré comhdhéanta de suas le 15 ball, má táthar ag súil an cás go deireanach níos mó ná 2 mhí

source: Even though you are called for jury service, you may not actually serve
ga: B’fhéidir nach ndéanfaidh tú seirbhís ghiúiré fiú má ghlaoitear ort chun seirbhís ghiúiré

source: Usually more people than necessary are called
ga: Glaoitear ar níos mo daoine ná mar is gá de ghnáth

source: You must return to court every day, whether or not you are sworn onto a jury panel, unless otherwise directed by the court
ga: Caithfidh tú filleadh ar cúirt gach lá, is cuma an gcuirtear faoi mhionn ar phainéal giúiré nó nach gcuirtear, mura dtreoraíonn an chúirt a mhalairt duit

source: Before you give your oath, either side in the case may challenge you
ga: Is féidir le ceachtar taobh den chás agóid a dhéanamh i do choinne sula dtugann tú do mhionn

source: This is simply an objection to a proposed juror
ga: Níl anseo ach agóid i gcoinne giúróra mholta

source: Each side may challenge 7 potential jurors without giving any reason and may challenge any number of jurors if they can "show cause"
ga: Féadann gach taobh agóid a dhéanamh i gcoinne 7 giúróirí féideartha gan aon chúis a thabhairt leis agus is féidir leo agóid a dhéanamh i gcoinne aon líon giúróirí más féidir leo "cúis a léiriú" leis

source: If you are challenged without reason being given, you will leave the jury box
ga: Má bhíonn agóid déanta i do choinne agus gan cúis tugtha leis, fágfaidh tú bosca na ngiúróirí

source: If you are challenged with reason, it is the judge who decides whether or not you will serve
ga: Má thugtar cúis leis an agóid, is é an breitheamh a chinnfidh an dtabharfaidh tú seirbhís nó nach dtabharfaidh

source: The members of the jury who have been selected will individually swear an oath or affirm that they will properly try the issue and give a true verdict according to the evidence
ga: Tabharfaidh an ball den ghiúiré atá roghnaithe mionnú ina n-aonar nó dearbhóidh siad go dtriailfidh siad an cheist i gceart agus go dtabharfaidh siad breithiúnas fírinneach de réir na fianaise

source: When the jury is sworn in and before the case starts, it will select a foreman from its members
ga: Nuair a bhíonn an giúiré curtha faoi mhionn agus sula dtosaíonn an cás, roghnaíonn sé príomhghiúróir oná bhaill

source: The foreman acts as an informal chairperson and spokesperson of the jury
ga: Gníomhaíonn an príomhghiúróir mar chathaoirleach neamhfhoirmiúil agus mar urlabharaí an ghiúiré

source: Payment on jury service
ga: Íocaíocht maidir le seirbhís ghiúiré

source: There is no payment for jury service
ga: Níl aon íocaíocht ar sheirbhís ghiúiré

source: Travelling expenses are not allowed
ga: Ní cheadaítear do chostais taistil

source: If you are actually serving as a juror, lunch will be provided on the day or days that the trial is at hearing
ga: Má bhíonn tú ag feidhmiú ar ghiúiré, cuirfear lón ar fáil ar an lá nó ar na laethanta a mbeidh an triail á héisteacht

source: If you are self-employed and work alone and where your attendance at jury service may mean you cannot earn a living, you may qualify for excusal from jury service
ga: Más féin-fhostaithe tú agus go n-oibríonn tú i d’aonar, agus sa chás go gciallódh do sheirbhís ghiúiré nárbh fhéidir leat do bheatha a thuilleamh, d’fhéadfadh sé go gcáileodh tú le do scaoileadh ó sheirbhís ghiúiré

source: Contact the jury office of the Court for more information
ga: Déan teagmháil le hoifig ghiúiré na Cúirte lena thuilleadh eolais

source: If you are signing on for a Jobseeker's payment you will continue to be paid, but you should advise your local Social Welfare Office that you have been called for jury service
ga: Mar sin féin, ba chóir duit comhairle a chur ar d'Oifig Leasa Shóisialaigh áitiúil go bhfuil tú bheith ar a dtugtar le haghaidh seirbhíse giúiré

source: If you are in employment, the Juries Act 1976 (Section 29) places a duty on your employer to allow you attend for jury service
ga: Má bhíonn tú i bhfostaíocht, leagann Acht na nGiúiréithe 1976 (Alt 29) dualgas ar d’fhostóir a ligean duit freastal ar sheirbhís ghiúiré

source: It is further specified in the law that time spent on jury service is to be treated as if the employee were actually employed
ga: Sonraítear sa dlí freisin go gcaithfear leis an seal ar sheirbhís ghiúiré mar is go mbeadh an fostaí i bhfostaíocht iarbhír

source: In other words, if you are in employment and are attending for jury service, you are entitled to be paid while you are away from work
ga: I bhfocail eile, má bhíonn tú fostaithe agus ag freastal ar sheirbhís ghiúiré, bíonn tú i dteidil d’íocaíochta agus tú ar shiúl ó do chuid oibre

source: Anyone with a contract of employment (i.e., temporary workers, contract workers, etc.) is entitled to be paid by their employer while they are on jury service
ga: Bíonn aon duine faoi chonradh fostaíochta (.i. oibrithe páirt-aimseartha, oibrithe conartha, srl.) i dteidil íocaíochta óna bhfostóir fad is a bhíonn siad ar sheirbhís ghiúiré

source: There should also be no loss of any other employment rights while you serve on a jury
ga: Níor cheart go gcaillfí aon chearta eile fostaíochta le linn duit a bheith ar ghiúiré ach an oiread

source: The Jury office will provide a certificate of attendance on request
ga: Soláthróidh an Oifig Ghiúiré teastas tinrimh ach é a iarraidh

source: If you feel your employment rights have been infringed or you have lost employment rights while serving on a jury, you can make a complaint to the Workplace Relations Commission using the online complaint form available on workplacerelations.ie
ga: Má bhraitheann tú gur sáraíodh do chearta fostaíochta nó gur chaill tú cearta fostaíochta le linn duit a bheith ag freastal ar ghiúiré, is féidir leat gearán a dhéanamh leis an gCoimisiún um Chaidreamh san Áit Oibre tríd an fhoirm ghearáin a úsáid á fáil ar workplacerelations.ie

source: Read more about enforcing your employment rights here
ga: Léigh tuilleadh faoi chearta fostaíochta a chur i bhfeidhm anseo
